In [41]:
import pandas as pd
df=pd.read_csv("titanic_2.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [42]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [43]:
Dependent_Variable=df.Survived
Independent_Variable=df.drop('Survived',axis='columns')

In [44]:
Dependent_Variable

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [45]:
Independent_Variable

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [46]:
dummies=pd.get_dummies(Independent_Variable.Sex)

In [47]:
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [48]:
independent_Variable=pd.concat([Independent_Variable,dummies],axis='columns')

In [49]:
independent_Variable

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [50]:
independent_Variable=independent_Variable.drop('Sex',axis='columns')

In [52]:
independent_Variable.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [54]:
independent_Variable.columns[independent_Variable.isna().any()]

Index(['Age'], dtype='object')

In [55]:
independent_Variable.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [56]:
import math
median=math.floor(independent_Variable.Age.mean())
median

29

In [58]:
independent_Variable.Age=independent_Variable.Age.fillna(median)

In [59]:
independent_Variable

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3  29.0  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [60]:
independent_Variable.columns[independent_Variable.isna().any()]

Index([], dtype='object')

In [136]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(independent_Variable,Dependent_Variable,test_size=0.2)

In [137]:
len(X_train)

712

In [138]:
len(X_test)

179

In [139]:
len(independent_Variable)

891

In [140]:
from sklearn.naive_bayes import GaussianNB

In [141]:
model=GaussianNB()

In [142]:
model.fit(X_train,y_train)

GaussianNB()

In [143]:
model.score(X_test,y_test)

0.8268156424581006

In [144]:
y_predicted=model.predict(X_test)

In [145]:
y_predicted[:10]

array([0, 0, 0, 1, 0, 0, 1, 1, 1, 0], dtype=int64)

In [152]:
import numpy as np
npa = np.asarray(y_test[:10], dtype=np.int64)

In [153]:
npa

array([0, 0, 0, 1, 1, 0, 1, 1, 1, 0], dtype=int64)